rdelivery/app/models/user.rb

def is_employee?
  Employee.find_by(id: self.id)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]