rdelivery/app/views/restaurants/new.html.erb

<%= form_with model: @restaurant do |form| %>
 <%= form.collection_select :user_id, User.all, :id, :name, prompt: true %>
 <%= form.collection_select :address_id, Address.all, :id, :street_address  %>
---
SELECT "users".* FROM "users"
SELECT "addresses".* FROM "addresses"