rdelivery/app/views/customers/new.html.erb

<%= form_with model: @customer do |form| %>
  <%= form.collection_select :user_id, User.all, :id, :name  %>
  <%= form.collection_select :address_id, Address.all, :id, :street_address  %>
---
SELECT "users".* FROM "users"
SELECT "addresses".* FROM "addresses"