rdelivery/app/views/product_orders/new.html.erb

<%= form_with model: @product_order do |form| %>
  <%= form.collection_select :product_id, Product.all, :id, :name  %>
   <%= form.collection_select :order_id, Order.all, :id, :restaurant_rating %>
---
SELECT "products".* FROM "products"
SELECT "orders".* FROM "orders"