rdelivery/app/views/couriers/new.html.erb

SELECT "users".* FROM "users"
---
<%= form_with model: @courier do |form| %>
  <%= form.collection_select :user_id, User.all, :id, :name  %>

SELECT "addresses".* FROM "addresses"
---
  <br/>
  <%= form.collection_select :address_id, Address.all, :id, :street_address  %>

SELECT "courier_statuses".* FROM "courier_statuses"
---
  <br/>
<%= form.collection_select :courier_status_id, CourierStatus.all, :id, :name  %>