rdelivery/app/controllers/addresses_controller.rb

INSERT INTO "addresses" ("street_address", "city", "postal_code", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["street_address", "30 Baltimore Ave"], ["city", "Massapequa"], ["postal_code", "11758"], ["created_at", "2023-04-06 17:20:46.268006"], ["updated_at", "2023-04-06 17:20:46.268006"]]
---
  def create
    address = Address.create(address_params)

UPDATE "addresses" SET "street_address" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["street_address", "1233 CodeBoxx Boulevard"], ["updated_at", "2023-04-10 00:19:34.862803"], ["id", 1]]
---
  def update

    @address.update(address_params)

DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 3]]
---
  def destroy

    @address.destroy

SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_address
    @address = Address.find(params[:id])