rdelivery/app/controllers/couriers_controller.rb

  def index
    @couriers = Courier.all
---
SELECT "couriers".* FROM "couriers"

  def create
    courier = Courier.create(courier_params)
---
INSERT INTO "couriers" ("phone", "email", "active", "created_at", "updated_at", "user_id", "address_id", "courier_status_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @courier.destroy
---
DELETE FROM "couriers" WHERE "couriers"."id" = ?  [["id", 1]]

  def current_courier
    @courier = Courier.find(params[:id])
---
SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]