rdelivery/app/controllers/courier_statuses_controller.rb

SELECT "courier_statuses".* FROM "courier_statuses"
---
  def index
    @courier_statuses = CourierStatus.all

INSERT INTO "courier_statuses" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "busy"], ["created_at", "2023-04-10 20:17:52.340147"], ["updated_at", "2023-04-10 20:17:52.340147"]]
---
  def create
    courier_status = CourierStatus.create(courier_status_params)

DELETE FROM "courier_statuses" WHERE "courier_statuses"."id" = ?  [["id", 1]]
---
  def destroy
    @courier_status.destroy

SELECT "courier_statuses".* FROM "courier_statuses" WHERE "courier_statuses"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_courier_status
    @courier_status = CourierStatus.find(params[:id])