rdelivery/app/controllers/customers_controller.rb

  def create
    customer = Customer.create(customer_params)
---
INSERT INTO "customers" ("phone", "email", "active", "created_at", "updated_at", "user_id", "address_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @customer.update(customer_params)
---
UPDATE "customers" SET "phone" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["phone", "7275069757"], ["updated_at", "2023-04-08 04:32:24.413069"], ["id", 1]]

  def current_customer
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]