rdelivery/app/controllers/employees_controller.rb

INSERT INTO "employees" ("phone", "email", "created_at", "updated_at", "user_id", "address_id") VALUES (?, ?, ?, ?, ?, ?)  [["phone", "6793402356"], ["email", "gabb7ylync@gmail.com"], ["created_at", "2023-04-07 13:52:13.203489"], ["updated_at", "2023-04-07 13:52:13.203489"], ["user_id", 3], ["address_id", 1]]
---
  def create
    employee = Employee.create(employee_params)

UPDATE "employees" SET "email" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["email", "erica.gger@codeboxxacademy.com"], ["updated_at", "2023-04-06 20:40:47.114039"], ["id", 1]]
---
  def update

    @employee.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 6]]
---
  def destroy

    @employee.destroy

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_employee
    @employee = Employee.find(params[:id])