rdelivery/app/controllers/orders_controller.rb

INSERT INTO "orders" ("restaurant_rating", "created_at", "updated_at", "customer_id", "restaurant_id", "order_status_id", "courier_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    order = Order.create(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_order
    @order = Order.find(params[:id])