rdelivery/app/controllers/order_statuses_controller.rb

  def index
    @order_statuses = OrderStatus.all
---
SELECT "order_statuses".* FROM "order_statuses"

  def create
    order_status = OrderStatus.create(order_status_params)
---
INSERT INTO "order_statuses" ("created_at", "updated_at", "name") VALUES (?, ?, ?)  [["created_at", "2023-04-10 14:23:49.713333"], ["updated_at", "2023-04-10 14:23:49.713333"], ["name", "hello"]]