rdelivery/app/controllers/products_controller.rb

  def create
    product = Product.create(product_params)
---
INSERT INTO "products" ("name", "description", "cost", "created_at", "updated_at", "restaurant_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Woody"], ["description", "Cowboy Doll"], ["cost", 12], ["created_at", "2023-04-08 05:39:15.032723"], ["updated_at", "2023-04-08 05:39:15.032723"], ["restaurant_id", 2]]

  def update
    @product.update(product_params)
---
UPDATE "products" SET "name" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["name", "Woodyy"], ["updated_at", "2023-04-10 00:20:09.628025"], ["id", 1]]

  def current_product
    @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]