rdelivery/app/controllers/product_orders_controller.rb

  def index
    @product_orders = ProductOrder.all
---
SELECT "product_orders".* FROM "product_orders"

  def new
    @product_order = ProductOrder.all
---
SELECT "orders".* FROM "orders"

  def create
    product_order = ProductOrder.create(product_order_params)
---
INSERT INTO "product_orders" ("product_quantity", "product_unit_cost", "created_at", "updated_at", "product_id", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_quantity", 10], ["product_unit_cost", 1], ["created_at", "2023-04-10 20:13:14.458349"], ["updated_at", "2023-04-10 20:13:14.458349"], ["product_id", 1], ["order_id", 1]]

  def destroy
    @product_order.destroy
---
DELETE FROM "product_orders" WHERE "product_orders"."id" = ?  [["id", 1]]

  def current_product_order
    @product_order = ProductOrder.find(params[:id])
---
SELECT "product_orders".* FROM "product_orders" WHERE "product_orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]