rdelivery/app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("phone", "email", "name", "price_range", "active", "created_at", "updated_at", "user_id", "address_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    restaurant = Restaurant.create(restaurant_params)

UPDATE "restaurants" SET "name" = ?, "active" = ?, "updated_at" = ? WHERE "restaurants"."id" = ?  [["name", "JoeBoyyyy"], ["active", 0], ["updated_at", "2023-04-10 00:19:17.503107"], ["id", 3]]
---
  def update
    @restaurant.update(restaurant_params)

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_restaurant
    @restaurant = Restaurant.find(params[:id])