rdelivery/app/controllers/api/auth_controller.rb

        def index
           json = JSON.parse(request.body.read)

           email = json['email']
           password = json['password']

           #user = variable
           #find_by the users provided email they type into the login
           #email: = column name you are searchig by
           #email = the email the user signed up with
           user = User.find_by(email: email)
        #    customer = Customer.find_by(user: user.id)
        #    courier = Courier.find_by(user: user)

           if  user.present? && user.valid_password?(password)
                # return render json: {success: true, user_id: user.id, customer_id: customer, courier_id: courier }, status: :ok

                customer = Customer.find_by(user_id: user.id)
                courier = Courier.find_by(user_id: user.id)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "erica.ger@gmail.com"], ["LIMIT", 1]]
SELECT "customers".* FROM "customers" WHERE "customers"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "couriers".* FROM "couriers" WHERE "couriers"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]