rdelivery/app/controllers/api/orders_controller.rb

        def format(order)
            {
                id: order.id,
                customer_id: order.customer.id,
                customer_name: order.customer.user.name,
                customer_address: order.customer.address.street_address,
                restaurant_id: order.restaurant.id,
                restaurant_name: order.restaurant.name,
                restaurant_address: order.restaurant.address.street_address,
                courier_id: order.courier&.id,
                courier_name: order.courier&.user&.name,
                status: order.order_status.name,

---
SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" IN (?, ?, ?, ?, ?, ?)  [["id", 6], ["id", 8], ["id", 4], ["id", 2], ["id", 3], ["id", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 1]]
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" IN (?, ?, ?, ?, ?)  [["id", 4], ["id", 1], ["id", 6], ["id", 3], ["id", 8]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]