rdelivery/app/controllers/api/orders_controller.rb

        def create
            restaurant_id, customer_id, products = params.values_at(:restaurant_id, :customer_id, :products)
            # Validate required parameters
            unless restaurant_id.present? && customer_id.present? && products.present?
                return render_400_error("Restaurant ID, customer ID, and products are required")
            end
            restaurant = Restaurant.find_by(id: restaurant_id)
            customer = Customer.find_by(id: customer_id)

            # Validate foreign keys exists
            unless restaurant && customer
                return render_422_error("Invalid restaurant or customer ID")
            end
            order = Order.create!(restaurant_id: restaurant_id, customer_id: customer_id, order_status_id: OrderStatus.find_by(name: "pending")&.id)
            # Validate order
            unless order
                return render_422_error("Failed to create order")
            end
            # Validate and create product orders
            products.each do |product_params|
                product = Product.find_by(id: product_params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]