rdelivery/app/controllers/api/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "order_statuses".* FROM "order_statuses" WHERE "order_statuses"."name" = ? LIMIT ?  [["name", "delivered"], ["LIMIT", 1]]
UPDATE "orders" SET "updated_at" = ?, "order_status_id" = ? WHERE "orders"."id" = ?  [["updated_at", "2023-04-13 21:27:31.127656"], ["order_status_id", 3], ["id", 1]]
---
        def status #this is for updating order by id

            #set status and id from params
            status = params[:status]
            id = params[:id]

            unless status.in?(["pending", "in progress", "delivered"])
                return render json: { success: false }, status: :unprocessable_entity
            end

            order = Order.find_by(id: id)
            if order == nil
                return render json: {error: "invalid order ID" }, status: :unprocessable_entity
            end
            order_status = OrderStatus.find_by(name: status)

            order.order_status_id = order_status.id
            order.save

SELECT "couriers".* FROM "couriers" WHERE "couriers"."id" IN (?, ?, ?, ?, ?)  [["id", 7], ["id", 5], ["id", 4], ["id", 2], ["id", 8]]
SELECT "orders".* FROM "orders" WHERE "orders"."restaurant_id" = ?  [["restaurant_id", 4]]
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
        def format(order)
            {
                id: order.id,
                customer_id: order.customer.id,
                customer_name: order.customer.user.name,
                customer_address: order.customer.address.street_address,
                restaurant_id: order.restaurant.id,
                restaurant_name: order.restaurant.name,
                restaurant_address: order.restaurant.address.street_address,
                courier_id: order.courier&.id,
                courier_name: order.courier&.user&.name,
                status: order.order_status.name,
