rdelivery/app/views/orders/new.html.erb

SELECT "customers".* FROM "customers"
SELECT "restaurants".* FROM "restaurants"
SELECT "order_statuses".* FROM "order_statuses"
SELECT "couriers".* FROM "couriers"
---
<%= form_with model: @order do |form| %>
  <%= form.collection_select :customer_id, Customer.all, :id, :email  %>
   <%= form.collection_select :restaurant_id, Restaurant.all, :id, :name  %>
    <%= form.collection_select :order_status_id, OrderStatus.all, :id, :name  %>
     <%= form.collection_select :courier_id, Courier.all, :id, :email  %>