rdelivery/app/views/products/new.html.erb

<%= form_with model: @product do |form| %>
  <%= form.collection_select :restaurant_id, Restaurant.all, :id, :name  %>
---
SELECT "restaurants".* FROM "restaurants"